app/views/countries/index.html.erb

          <div class="breatcome-content-title">
            <h1><%= t('countries.index.countries')%></h1>
---
SELECT COUNT(*) FROM "countries"
SELECT "countries".* FROM "countries"