app/views/posts/index.html.erb

SELECT "posts".* FROM "posts"
---
    /
    <%= Post.count %>