app/controllers/countries_controller.rb

  def index
    @countries = Country.all
---
SELECT "countries".* FROM "countries"
SELECT COUNT(*) FROM "countries"

  def show
    @country = Country.find(params[:id])
---
SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]