app/controllers/posts_controller.rb

  def create
    #render plain: params[:article].inspect
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("name", "image", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "gftwwagtaw"], ["image", nil], ["content", "waegtwagtg"], ["created_at", "2022-05-24 15:40:55.063416"], ["updated_at", "2022-05-24 15:40:55.063416"]]

  def update

    if @post.update(post_params)
---
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "waegtwagtgsdgseg"], ["updated_at", "2022-05-24 15:55:10.028955"], ["id", 12]]