app/controllers/programs_controller.rb

  def show
    @program = Program.find(params[:id])
---
SELECT "programs".* FROM "programs" WHERE "programs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]