app/controllers/residences_controller.rb

  def show
    @residence = Residence.find(params[:id])
---
SELECT "residences".* FROM "residences" WHERE "residences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]