app/controllers/concerns/user_oath.rb

  def create_authorization(auth)
    authorizations.create(provider: auth.provider, uid: auth.uid)
---
INSERT INTO "authorizations" ("user_id", "provider", "uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["provider", "github"], ["uid", "94631599"], ["created_at", "2022-05-16 23:04:20.150821"], ["updated_at", "2022-05-16 23:04:20.150821"]]

    def find_for_oauth(auth)
      authorization = Authorization
                      .where(provider: auth.provider, uid: auth.uid)
                      .first

      return  authorization.user if authorization

      email = auth.info[:email]
      user  = User.where(email: email).first

      email ||= create_email(auth) if email.nil?

      if user
        user.create_authorization(auth)
      else
        password = Devise.friendly_token[0, 20]
        user     = User.create!(email: email,
                                password: password,
                                password_confirmation: password)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "olegchornyi82@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("admin", "created_at", "updated_at", "email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "provider", "uid") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"